# Lab 5

In [1]:
import pandas as pd
import arff
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

In [2]:
with open('dane.arff', 'r') as f:
    data = arff.load(f)
attributes = [attr[0] for attr in data['attributes']]
data_rows = data['data']
df = pd.DataFrame(data_rows, columns=attributes)

Dokonaj wstępnej inspekcji pierwszych 20 wierszy. Co widzisz? Jaka jest liczba (features) cech w zbiorze?
 - features: 14
 - brakuje danych w features: age,cabin,embarked,boat,body,home.dest
 - przy czym boat cabin i body mają ponad 50% brakujących danych, body aż 90%

VARIABLE DESCRIPTIONS
- Pclass Passenger Class (1 = 1st; 2 = 2nd; 3 = 3rd)
- survival Survival (0 = No; 1 = Yes)
- name Name
- sex Sex
- age Age
- sibsp Number of Siblings/Spouses Aboard
- parch Number of Parents/Children Aboard
- ticket Ticket Number
- fare Passenger Fare (British pound)
- cabin Cabin
- embarked Port of Embarkation (C = Cherbourg; Q = Queenstown; S = Southampton)
- boat Lifeboat
- body Body Identification Number
- home.dest Home/Destination

In [3]:
df.head(10)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,None,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,None,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,None,NaN,"Montreal, PQ / Chesterville, ON"
5,1.0,1,"Anderson, Mr. Harry",male,48.0000,0.0,0.0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1.0,1,"Andrews, Miss. Kornelia Theodosia",female,63.0000,1.0,0.0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
7,1.0,0,"Andrews, Mr. Thomas Jr",male,39.0000,0.0,0.0,112050,0.0000,A36,S,None,NaN,"Belfast, NI"
8,1.0,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0000,2.0,0.0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
9,1.0,0,"Artagaveytia, Mr. Ramon",male,71.0000,0.0,0.0,PC 17609,49.5042,None,C,None,22.0,"Montevideo, Uruguay"

In [4]:
print('Wymiary: rows:', df.shape[0],'features:', df.shape[1])
print(df.isnull().sum())
print(df.isnull().mean())

Wymiary: rows: 1309 features: 14
pclass          0
survived        0
name            0
sex             0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64
pclass       0.000000
survived     0.000000
name         0.000000
sex          0.000000
age          0.200917
sibsp        0.000000
parch        0.000000
ticket       0.000000
fare         0.000764
cabin        0.774637
embarked     0.001528
boat         0.628724
body         0.907563
home.dest    0.430863
dtype: float64

Zbadajmy feature: body, ponieważ tam brakuje najwięcej danych

In [5]:
non_survivors = df.groupby('survived').size()[0]
found_bodies = df.groupby('survived')['body'].count()[0]
not_found_bodies = non_survivors - found_bodies
survivors_and_not_found_bodies = len(df['survived']) - found_bodies
print('Ilość osób które nie przeżyły:',non_survivors)

print('Ilość znalezionych ciał:',found_bodies)

print('Ilość NIE znalezionych ciał:',not_found_bodies)

print("Ilość wartości NaN:", survivors_and_not_found_bodies) 
print("Suma NIE znalezionych ciał i osób które przeżyły jest równa ilości wartośći NaN w naszym zbiorze, stąd ponad 90% 'brakujących' danych")
print("Oznacza to, że jest to MNAR, ponieważ dla każdego survived == 1, mamy NaN")

Ilość osób które nie przeżyły: 809
Ilość znalezionych ciał: 121
Ilość NIE znalezionych ciał: 688
Ilość wartości NaN: 1188
Suma NIE znalezionych ciał i osób które przeżyły jest równa ilości wartośći NaN w naszym zbiorze, stąd ponad 90% 'brakujących' danych
Oznacza to, że jest to MNAR, ponieważ dla każdego survived == 1, mamy NaN

Następnie zbadajmy feature: cabin == MAR

In [6]:
df['cabinNull'] = np.where(df['cabin'].isnull(), 1, 0)
print(df.groupby(['survived','cabinNull']).size())
print('Najwięcej danych brakuje dla osób, które nie przeżyły: 707. Co ciekawe dla osób, które przetrwały mamy 307 brakujących danych')
print('Może pasażerowie w ramach szoku zapomnieli, w jakich kabinach mieszkali, lub jest to część załogi, która mieszkała w niezonazkowanych kabinach')
print('Jest to jedynie spekulacja, więc możemy oznaczyć tą kolumną jako MAR, ponieważ brakujące dane nie mają jednostajnego rozkładu')

survived  cabinNull
0         0            102
          1            707
1         0            193
          1            307
dtype: int64
Najwięcej danych brakuje dla osób, które nie przeżyły: 707. Co ciekawe dla osób, które przetrwały mamy 307 brakujących danych
Może pasażerowie w ramach szoku zapomnieli, w jakich kabinach mieszkali, lub jest to część załogi, która mieszkała w niezonazkowanych kabinach
Jest to jedynie spekulacja, więc możemy oznaczyć tą kolumną jako MAR, ponieważ brakujące dane nie mają jednostajnego rozkładu

Następnie zbadajmy feature: boat == MNAR

In [7]:
df['boatNull'] = np.where(df['boat'].isnull(), 1, 0)
print(df.groupby(['survived','boatNull']).size())
print("9 osób, które nie przeżyły, były na łodzi oraz 23 osoby które były na łodziach nie przeżyły")
print('Jak można się domyślić, wartość NaN w kolumnie: boat, oznacza, że osoba nie wylądowała na szalupie ratunkowej, ponieważ aż 800 osób które nie przetrwało, nie było na łodziach. A 477 które przetrwało było na łodziach. Więc jest tu ewidentna zależność')
print('Tak więc, brakujące dane w kolumnie: boat oznaczymy jako MNAR')

survived  boatNull
0         0             9
          1           800
1         0           477
          1            23
dtype: int64
9 osób, które nie przeżyły, były na łodzi oraz 23 osoby które były na łodziach nie przeżyły
Jak można się domyślić, wartość NaN w kolumnie: boat, oznacza, że osoba nie wylądowała na szalupie ratunkowej, ponieważ aż 800 osób które nie przetrwało, nie było na łodziach. A 477 które przetrwało było na łodziach. Więc jest tu ewidentna zależność
Tak więc, brakujące dane w kolumnie: boat oznaczymy jako MNAR

In [10]:
# FUN FACT 
df.groupby('sex')["fare"].mean()

sex
female    46.198097
male      26.154601
Name: fare, dtype: float64

Następnie zbadajmy feature: home.dst == MAR

In [18]:
df['home.destNull'] = np.where(df['home.dest'].isnull(), 1, 0)
print(df.groupby(['survived','home.destNull']).size())
print("Nie dostrzegam, żadnej zależności pomiędzy survivied a home.dest. Więc można sklasyfikować tą kolumnę jako MAR, nie MCAR, ponieważ dane nie są rozłożenie porówno")

survived  home.destNull
0         0                398
          1                411
1         0                347
          1                153
dtype: int64
Nie dostrzegam, żadnej zależności pomiędzy survivied a home.dest. Więc można sklasyfikować tą kolumnę jako MAR, nie MCAR, ponieważ dane nie są rozłożenie porówno